ReikanYsora/Helios-Mini/firmware/sdkconfig.defaults
# Helios Mini V0.1 - Waveshare ESP32-S3-Touch-AMOLED-1.32
#
# Base values mirror Waveshare's own proven ESP-IDF 5.5.1 example for this
# exact board (07_LVGL_V9_Test/sdkconfig.defaults) minus their demo widgets.
# See docs/HARDWARE_REFERENCE.md.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_FREERTOS_HZ=1000

# LVGL v9 (lvgl/lvgl managed component) configuration via Kconfig.
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_COLOR_SCREEN_TRANSP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_FONT_MONTSERRAT_16=y
